<?php

/******************************************************
 *  GET
 *     البيانات تظهر في رابط المتصفح
 *     مناسبة للبحث أو الروابط القابلة للمشاركة
 *     غير مناسبة للبيانات الحساسة
 ******************************************************/

if (isset($_GET['search'])) {
    $search = $_GET['search']; 
    echo "<h3>نتيجة GET:</h3>";
    echo "قيمة البحث هي " . $search . "<br>";
}


/******************************************************
 *  POST
 *     البيانات لا تظهر في الرابط
 *    مناسبة للبيانات الحساسة (كلمات مرور، تسجيل دخول)
 *     حجم البيانات أكبر من GET
 ******************************************************/

if (isset($_POST['username'])) {
    $username = $_POST['username']; // استقبال البيانات من POST
    echo "<h3>نتيجة POST:</h3>";
    echo "اسم المستخدم هو: " . $username . "<br>";
}

?>

<!-- ******************************************************
     مثال GET
     page.php?search=Jamal
******************************************************* -->
<h2>Form باستخدام GET</h2>
<form method="GET" action="">
    <label>ابحث عن شيء:</label>
    <input type="text" name="search">
    <button type="submit">إرسال GET</button>
</form>


<!-- ******************************************************
     نموذج POST
     عند الإرسال لن تظهر البيانات في الرابط
******************************************************* -->
<h2>Form باستخدام POST</h2>
<form method="POST" action="">
    <label>اسم المستخدم:</label>
    <input type="text" name="username">
    <button type="submit">إرسال POST</button>
</form>
